Membalik urutan baris dan kolom pada Data Frame

In [11]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [10]:
n_rows = 5
n_cols = 5

cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size =(n_rows,n_cols)) , columns = cols)

df

   A  B  C  D  E
0  2  7  2  8  5
1  6  7  6  6  3
2  4  4  3  5  6
3  4  9  1  2  6
4  1  4  7  4  9

Membalik urutan kolom pada tabel

In [12]:
df.loc[: , ::-1] #bagian pertama dalam kolom tersebut untuk mengatur baris
                    #bagian kedua dalam kolom untuk mengatur kolom 
                #start:end:step (blank:blank:-1) default step = 1, reverse = -1

   E  D  C  B  A
0  5  8  2  7  2
1  3  6  6  7  6
2  6  5  3  4  4
3  6  2  1  9  4
4  9  4  7  4  1

Membalik urutan baris pada tabel

In [14]:
df.loc[::-1 , :] # bisa juga di simpelkan dengan menggunakan 'df.loc[::-1]'

   A  B  C  D  E
4  1  4  7  4  9
3  4  9  1  2  6
2  4  4  3  5  6
1  6  7  6  6  3
0  2  7  2  8  5

Membalik urutan baris dan melakukan penyesuaian ulang Index

In [16]:
df.loc[::-1].reset_index(drop=True) #Mengganti baris tetapi urutan index nomor pada tabel tetap

   A  B  C  D  E
0  1  4  7  4  9
1  4  9  1  2  6
2  4  4  3  5  6
3  6  7  6  6  3
4  2  7  2  8  5